DataProcessors/МенеджерЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>МенеджерЗадач</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AccessToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RefreshToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЖизниТокена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запомнить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Addition</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Reading</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сhange</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Partner</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/МенеджерЗадач/Ext/ObjectModule.bsl
Процедура ОбновитьТокены() Экспорт 
	
	АдресРесурса = СтрШаблон("%1/auth/v1/refresh", АдресСервера);
		
	ДанныеJSON = Новый Структура;
	ДанныеJSON.Вставить("RefreshToken", RefreshToken);
	
	ДополнительныеПараметрыЗапроса = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметрыЗапроса.Json = ДанныеJSON;
	
	Попытка
		Ответ = КоннекторHTTP.Post(АдресРесурса,, ДополнительныеПараметрыЗапроса);
	Исключение		
		ВызватьИсключение "Ошибка подключения";
	КонецПопытки;
	
	Если Ответ.КодСостояния > 300 Тогда	
		
		Если Запомнить Тогда
			Константы.RefreshТокен.Установить("");
		КонецЕсли;
		
		AccessToken  = "";
		RefreshToken = "";
		ВремяЖизниТокена = '00010101';
		
		Если Ответ.КодСостояния = 401 Тогда			
			ВызватьИсключение "Токен недействителен";	
		Иначе
			ВызватьИсключение "Что-то пошло не так. Обратитесь в поддержку";
		КонецЕсли;	
	КонецЕсли;;
	
	Попытка		
		ПараметрыПреобразования = Новый Структура;
		ПараметрыПреобразования.Вставить("ПрочитатьВСоответствие", Ложь);	
		
		Данные = КоннекторHTTP.КакJson(Ответ, ПараметрыПреобразования);
	Исключение
		Если Запомнить Тогда
			Константы.RefreshТокен.Установить("");
		КонецЕсли;
		
		AccessToken  = "";
		RefreshToken = "";
		ВремяЖизниТокена = '00010101';
						
		ВызватьИсключение "Ошибка разбора ответа";	
	КонецПопытки;
	
	AccessToken = Данные.accessToken;
	RefreshToken = Данные.refreshToken;
	ВремяЖизниТокена = ТекущаяДатаСеанса() + Данные.expires;
	
	Если Запомнить Тогда
		Константы.RefreshТокен.Установить(RefreshToken);	
	КонецЕсли;	
	
КонецПроцедуры
